{
    "admitreq": {
        "paragraphs": [
{ "style" : "p", "content" : "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determineif
the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students mayset
their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends."},
]
},
"programhighlights": {
    "paragraphs": [
{ "style" : "p", "content" : "This program prepares students to enter and progress in the secretarial field. Upon graduation, the new Executive Assistant is able to meet the challenges of the new millennium with the skills most currently required by employers.Each
graduate will attain a sense of achievement while ensuring a successful career."},
]
},
"careeropp": {
    "paragraphs": [
{ "style" : "p", "content" : "In the corporate environment, a skilled Executive Assistant can be an invaluable member of the management team. Opportunities and compensation are better than ever in this area. This type of position may lead into the managementstream
for those who perform well and possess the skills."},
]
},
"corecourses": {
    "paragraphs": [
{ "style" : "p", "content" : "pon completion of the program the participant must demonstrate the following core competencies:"}, { "ul_start" : "true"}, { "style" : "li", "li_title" : " Keyboarding", "content" : " Minimum 55 words per minute (WPM)."},{
"style" : "li", "li_title" : " Operating Systems", "content" : " Advanced level of proficiency in a Windows operating system"}, { "style" : "li", "li_title" : "Word Processing", "content" : " Advanced level of proficiency in Microsoft Word"}, { "style":
"li", "li_title" : "Spreadsheets", "content" : " Intermediate level of proficiency in Microsoft Excel"}, { "style" : "li", "li_title" : "Database Management", "content" : " Basic level of proficiency in Microsoft Access"}, { "style" : "li", "li_title":
" Simulations and Drills", "content" : " Practical Applications – 3 Units"}, { "style" : "li", "li_title" : " Graphics/Presentation", "content" : " Advanced level of proficiency in Microsoft PowerPoint, Photoshop Basics, and Microsoft Publisher"}, {"style"
: "li", "li_title" : " Web Design", "content" : " Dreamweaver 1"}, { "style" : "li", "li_title" : " Business Skills", "content" : " Customer Service, Grammar Essentials for Business Writing, Business Correspondence Levels 1 and 2, and ManagementFundamentals"},
{ "style" : "li", "li_title" : " Office Skills", "content" : " Personal Computer Fundamentals for End Users, Office Procedures Levels 1 and 2, Internet Fundamentals, and basic level of proficiency in Microsoft Outlook"}, { "style" : "li","li_title" :
" Job Readiness/Employability Skills", "content" : " Job Search and Résumé Writing and Thought Patterns for a Successful Career"}, { "ul_end": "true" },
]
},
"salarystart":
36238
,
"salaryend":
69234
}
