{
    "admitreq": {
        "paragraphs": [
{ "style" : "p", "content" : "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instructions. Applicants whose first language is not English mustprovide
proof of English proficiency."}, { "style" : "p", "content" : "In admissions interview will be administered to determine if the applicant has the required interest, motivation, and entry-level skills to take this program."}, { "style" : "p", "content":Full-time
students must attend the required hours per week as per the course schedule and may do so at times convenient to them."},
]
},
"programhighlights": {
    "paragraphs": [
{ "style" : "p", "content" : "In the Software and Web Developer diploma program, students learn the coding languages that every web developer needs to know: HTML, CSS, and JavaScript. Students then broaden their skill set with a strong foundation in SQL,C#,
and the .NET Framework that will lead to additional opportunities in the world of software development."}, { "style" : "p", "content" : "hroughout the program, students gain hands-on experience with a range of software development projects that buildin
complexity as students add programming skills and languages to their toolkit."}, { "style" : "p", "content" : "Graduates of the program will be able to:"}, { "ul_start": "true" }, { "style" : "li", "content": "Design the appearance and layout of websites"},{
"style" : "li", "content": "Develop cross-browser and cross-platform websites"}, { "style" : "li", "content": "Create and optimize content for websites using graphics, databases, animations, and other software "}, { "style" : "li", "content": "Translatewire
frames and storyboards into functional, responsive websites"}, { "style" : "li", "content": "Work with MySQL databases and SQL scripting"}, { "style" : "li", "content": "Use the .NET Framework to create robust web applications"}, { "ul_end": "true"},
]
},
"careeropp": {
    "paragraphs": [
{ "style" : "p", "content" : "Graduates of the program may pursue a variety of positions in software development, including web developer, UI/UX developer, front end web developer, software developer, HTML / CSS developer, and Javascript / jQuery developer."},
<h2>Program Notes</h2>{ "style" : "p", "content" : "uition fees include all course materials. Financial assistance may be available for those who qualify."}, { "style" : "p", "content" : "Graduation requirements: Students must maintain a 75% program average
to obtain a diploma."},
<h2>Method of Delivery</h2>{ "style" : "p", "content" : "Integrated Learning&reg; System training facilitated by qualified learning coaches."},
]
},
"corecourses": {
    "paragraphs": [
{ "style" : "p", "content":<b>Core Courses</b>"}, { "ul_start" : "true"}, { "style" : "li", "li_title" : "<b>Keyboarding</b>", "content" : " Minimum 25 words per minute (WPM)."}, { "style" : "li", "li_title" : " <b> Operating Systems</b>", "content" :
" Intermediate level of proficiencywith Windows OS"}, { "style" : "li", "li_title" : " <b>Software Development Industry</b>", "content" : " Computer and Technology Basics for Developers, Overview of Software Development"}, { "style" : "li", "li_title"
: " <b>Software and Web Development Skills</b>","content" : " Version Control, HTML, CSS and Bootstrap, JavaScript, Visual Studio, C#, .NET Framework"}, { "style" : "li", "li_title" : " <b>Database Skills</b> Intermediate level of proficiency in Microsoft
Access, Database and SQL"}, { "style" : "li","li_title" : ""},<b>Presentations</b>", "content" : " Basic level of proficiency in Microsoft PowerPoint"}, { "style" : "li", "li_title" : " <b>Word Processing and Spreadsheets</b>", "content" : " Basic level
of proficiency in Microsoft Word and MicrosoftExcel"}, { "style" : "li", "li_title" : " <b>Office Skills</b>", "content" : " Personal Computer Fundamentals, basic level of proficiency in Microsoft Outlook and Internet Fundamentals"}, { "style" : "li",
"li_title" : " <b> Business Skills</b>", "content" : "Customer Service, Project Management"}, { "ul_end": "true" },
]
},
"salarystart":
40000
,
"salaryend":
87000
}
