{
    "admitreq": {
        "paragraphs": [
{ "style" : "p", "content" : "Grade 12 or equivalent or Mature Student Status. Courses are open to any applicant who possesses a good command of the English language and is able to follow instruction. An admissions interview will be administered to determineif
the applicant has the required interest, motivation, and entry-level skills to take this program. Full-time students must attend the required hours per week as per the course schedule and may do so at times convenient to them. Part-time students mayset
their own schedules to a minimum of two training sessions per week. These times may be scheduled during the day, evenings, or on weekends."},
]
},
"programhighlights": {
    "paragraphs": [
{ "style" : "p", "content" : "eetings, events and conventions are one of the fastest growing segments of the economy and embrace multiple aspects of all industries. The Conference and Event Planner Diploma is designed to prepare students for careers inthe
fast-paced and exciting world of conference and event management. This program appeals to individuals who are charismatic, outgoing, energetic, and entrepreneurial, as the Conference and Event Planner plays a dynamic role within any organization.Its objective
is to expose students to a broad range of knowledge and processes, administration skills, and practical tools that will assist them in dealing with situations within a conference and event planning related career. The program provides theskills to progress
into higher-level careers, given the proper combination of skills, experience, personal attributes, and additional training. This program provides students with:"}, { "ul_start": "true" }, { "style" : "li", "content": "The knowledgeand skills necessary
to lead and/or assist in the development and/or implementation of conferences and events for a variety of business sectors."}, { "style" : "li", "content": "An introduction to the most relevant aspects of planning and coordinatingevent logistics."}, {
"style" : "li", "content": "Professional skills in high demand by employers. These skills include: negotiating, decision making, teamwork, communication, customer service, leadership, research and problem solving."}, { "style" :"li", "content": "A solid
knowledge of event planning and marketing practices and principles."}, { "style" : "li", "content": "Proficiency in Microsoft Office applications."}, { "ul_end": "true" },
]
},
"careeropp": {
    "paragraphs": [
{ "style" : "p", "content" : "Graduates of this program are employed by tourism, trade and professional associations, convention and conference centers, government agencies and conference and event planning companies. Careers that correspond with the
skillslearned in this program include: "}, { "ul_start": "true" }, { "style" : "li", "content": "Conference and Meeting Planner"}, { "style" : "li", "content": "Conference Planner"}, { "style" : "li", "content": "Conference Services Officer"}, { "style"
: "li","content": "Convention Coordinator"}, { "style" : "li", "content": "Event Planner"}, { "style" : "li", "content": "Special Events Organizer"}, { "style" : "li", "content": "Trade Show Planner"}, { "ul_end": "true" },
]
},
"corecourses": {
    "paragraphs": [
{ "style" : "p", "content" : "pon completion of the program the participant must demonstrate the following core competencies:"}, { "ul_start" : "true"}, { "style" : "li", "li_title" : "Word Processing", "content" : " Intermediate level of proficiencyin
Microsoft Word"}, { "style" : "li", "li_title" : "Spreadsheets", "content" : " Basic level of proficiency in Microsoft Excel"}, { "style" : "li", "li_title" : "Graphics/Presentation", "content" : " Basic level of proficiency in Microsoft PowerPointand
Microsoft Publisher"}, { "style" : "li", "li_title" : "Data Management", "content" : " Basic level of proficiency in Microsoft Access"}, { "style" : "li", "li_title" : "Simulations and Drills", "content" : " Practical Applications – 2 Units"}, { "style":
"li", "li_title" : "Office Skills", "content" : " Basic level of proficiency in Microsoft Outlook"}, { "style" : "li", "li_title" : "Business Skills", "content" : " Customer Service, Grammar Essentials for Business Writing, Business Correspondence Levels1
and 2, Business Essentials, Business Math, Marketing and Sales, Conference and Event Management, Event Marketing, Microsoft Project Level 1, Project Management Fundamentals Level 1, Business Negotiations and Contracts, Management Fundamentals, BusinessSupervisory
Skills, Business Verbal Communication, and Business Presentations"}, { "style" : "li", "li_title" : "Employability Skills", "content" : " Job Search and Résumé Writing, Employment Success Strategies, and Thought Patterns for a Successful Career"},{ "ul_end":
"true" },
]
},
"salarystart":
30554
,
"salaryend":
60443
}
