[
    {
        "header": "INTEGRATED LEARNING SYSTEM",
        "content": "The secret of our students' success comes from training with Academy of Learning Career College's exclusive Integrated Learning System. Available only at Academy of Learning Career College, the Integrated Learning System has helped our graduates successfully complete over one million training courses. In today's job market, everyone is looking for a competitive advantage. Here's how the Integrated Learning System can give you the edge."
    },
    {
        "header": "STUDENT FOCUSED TRAINING",
        "content":"We’ve shifted the focus from teaching and put it where it belongs, on learning. Recognizing that every person is an individual, the Integrated Learning System is effective enough and flexible enough to fit your particular learning needs."
    },
    {
        "header": "COMPETENCY BASED LEARNING",
        "content": "Each lesson contains a clearly defined  and tests the understanding of the content. If you do not fully understand the lesson, you can repeat it before moving on to the next one."
    },
    {
        "header": "NO COMPUTER OR SPECIAL SKILLS REQUIRED",
        "content": "Whatever skills you have when you enroll, we can start you at the level that is right for you. Academy of Learning Career College will provide you with the learning tools that you need."
    },
    {
        "header": "START IMMEDIATELY",
        "content": "You can start right away and begin learning immediately."
    },
    {
        "header": "LEARN AT YOUR OWN PACE",
        "content": "The exclusive Integrated Learning™ System allows you to learn at your own pace within your flexible committed guidelines. There’s no need to keep pace with other students."  
    },
    {
        "header": "LEARN THE BETTER WAY",
        "content": "With Academy of Learning Career College, you learn by doing – not by just listening. Research shows that “Learning by Doing” is the most effective way to retain what we learn. By just hearing something we remember 30%, by just seeing it we remember 40%, but by doing it we remember 70%."
    },
    {
        "header": "TAILORED FOR LEARNING SUCCESS",
        "content": "ILS uses a competency-based, building block approach, steadily increasing learners’ skill level and presenting them with opportunities to practice and apply what they have learned in authentic, real-world situations and settings. ILS’ listening, reading, viewing, and hands-on tasks, combined with the personalized, one-on-one support learners receive from a qualified facilitator, is definitely a recipe for success."
    }
]